app/controllers/courses_controller.rb

  def index
    @newsfeed = Newsfeed.all
---
SELECT * FROM "newsfeeds" ORDER BY created_at DESC

  def show
    @courses = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = '--- :id