app/controllers/course_instances_controller.rb

  def show
    @ci = CourseInstance.find_by_id(params[:id])
---
SELECT * FROM "course_instances" WHERE ("course_instances".course_id = 42) ORDER BY course_instances.id DESC LIMIT 1