app/controllers/exams_controller.rb

  def show
    @exam = Exam.find_by_id(params[:id])
---
SELECT * FROM "exams" WHERE ("exams"."id" = '1') LIMIT 1

  def join
    if params[:id]
      begin
        Exam.find_by_id(params[:id]).take_part(User.find_by_id(session[:user]))
      rescue
        flash[:warning]="Ongelma"
        redirect_to course_exam_path(Exam.find_by_id(params[:id]).course,Exam.find_by_id(params[:id]))  and return
---
SELECT * FROM "exams" WHERE ("exams"."id" = '1') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1
SELECT * FROM "courses" WHERE ("courses"."id" = 1)