app/controllers/exercise_groups_controller.rb

SELECT * FROM "exercise_groups" WHERE ("exercise_groups"."id" IS NULL) LIMIT 1
---
  def show
    @ex = ExerciseGroup.find_by_id(params[:id])

SELECT "users".* FROM "users" INNER JOIN "registrations" ON "users".id = "registrations".user_id WHERE ("users"."id" = 1) AND (("registrations".exercise_group_id = 1)) LIMIT 1
SELECT * FROM "exercise_groups" WHERE ("exercise_groups".course_instance_id = 24)
---
  def join
    if params[:id]
    ExerciseGroup.find_by_id(params[:id]).join(User.find_by_id(session[:user]))