app/controllers/mailer_controller.rb

  def show
    if params[:user]
    @destination = User.find_by_id(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    if(User.find_by_username(params[:user]))==nil
---
SELECT * FROM "users" WHERE ("users"."username" = 'late') LIMIT 1