app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
SELECT * FROM "users" WHERE (username = 'late' AND password = 'late') LIMIT 1
UPDATE "users" SET "email" = 'emailiosoiteq2', "student_number" = '', "surname" = '', "updated_at" = '2009-12-03 13:45:38', "first_name" = 'dsa' WHERE "id" = 2
---
  def create
    u = User.find_by_id(session[:user])

    if params[:user][:password3]!=params[:user][:password2]
      flash[:warning]= "Uudet salasanat ei täsmää"
      redirect_to :controller=>:users, :action=>:index
      return
    end
    begin
      ok = User.authenticate(u.username, params[:user][:password])
    rescue
      flash[:warning]="Väärä salasana, tietoja ei tallenettu"
      redirect_to :controller=>:users, :action=>:index
      return

    end
    if ok
      u.first_name = params[:user][:first_name]
      u.surname = params[:user][:surname]
      u.student_number = params[:user][:student_number]
      if params[:user][:password2]==""||params[:user][:password3]==""
        u.save