app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
---
  def index
    @u = User.find(:all)

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
    if params[:id]
    @u = User.find_by_id(params[:id]) and return

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def edit
    @user = User.find_by_id(session[:user])

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "email" = 'sds', "student_number" = 'a', "password" = '122', "surname" = 'a', "updated_at" = '2009-12-04 12:59:04', "first_name" = 'asd' WHERE "id" = 2
---
  def update
    @user = User.find_by_id(session[:user])
    if params[:commit]=="Poista käyttäjätili"
      if(User.authenticate(@user.username,params[:user][:password]))
        render :template => "users/confirm", :layout=>true
        return
      end
      flash[:warning]="Väärä salasana"
      render  :action=>:edit
      return
    end
    if (params[:commit]=="Vaihda salasana")
      if(User.authenticate(@user.username,params[:password_vanha]))
        @user1 = @user
        @user1.password = params[:password]
        @user1.password_confirmation= params[:password_confirmation]
        @user1.save

INSERT INTO "users" ("updated_at", "username", "account_type", "student_number", "first_name", "password", "surname", "email", "created_at") VALUES('2009-12-04 17:03:27', 'late', 'User', NULL, NULL, 'late', NULL, NULL, '2009-12-04 17:03:27')
---
  def create
    @user = User.new(params[:user])

    if @user.save

DELETE FROM "users" WHERE ("id" IN (6))
SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
---
  def destroy
    User.find_by_id(session[:user]).delete

SELECT * FROM "newsfeeds" WHERE ("newsfeeds"."id" = '13') ORDER BY created_at DESC LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def like_newsfeed
    if params[:id]
      begin
        Newsfeed.find_by_id(params[:id]).like(User.find_by_id(session[:user]))